<h1 style='color:rgb(255, 95, 31)'>DATA GATHERING:</h1><br>
<i style="font-size:16px">To create a model and work on that, the first thing we need is <b>DATA.</b><br>
But, How do we get that data?</i>

<h2 style="color:rgb(100, 149, 237)">There are various ways of doing that:</h2>
   <p style="font-size:16px;">1. From csv Files<br>
    2. Json/SQL files<br>
    3. Fetch data from API<br>
    4. Web-Scrapping
    </p>
    <p style="font-size:16px">We are going to study all these methods below:</p>

In [20]:
import pandas as pd

<h2 style="color:rgb(50, 205, 50)">1. From CSV Files: </h2>
<p style="font-size:16px">CSV = Comma Separated Files:<br>
 These files can be uploaded from local storage by just providing the path of that file in <b>read_csv()</b> function.</p>
 <p style="font-size:16px"> Below we're going to study some important <span style="color:rgb(207, 159, 255)">PARAMETERS</span> of <span style="color:rgb(207, 159, 255)">read_csv()</span> function: </p>

##  (i) Opening a local csv file

In [56]:
df = pd.read_csv("datasets/aug_train.csv")
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [ ]:
# describe():
stats = df.describe()
# lets see what describe() returns, as it turns out, it returns a dataframe.
type(stats)

In [16]:
stats

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

<hr style="margin-bottom: 50px;"> 
<span style="color:rgb(0, 255, 255);font-weight:bold; font-size:25px"> describe():</span>
<ul style="list-style-type:square">
  <li>function provides descriptive statistics about the <b>numerical columns</b> in the DataFrame.</li>
  <li>Returns a DataFrame containing these statistics.</li>
</ul>
<span style="font-size:18px">It tells 7 things, decribed below:</span><br>
1. <b style="text-decoration:underline">Count:</b>  Number of non-null values in each column.<br>
2. <b style="text-decoration:underline">Mean:</b>  Mean (average) value of each column.<br>
3. <b style="text-decoration:underline">Std:</b>  Standard deviation, which measures the dispersion or spread of the values in each column.<br>
3. <b style="text-decoration:underline">Min:</b>  Minimum value in each column.<br>
4. <b style="text-decoration:underline">25% (Percentile):</b>  Value below which 25% of the data falls (first quartile or 25th percentile).<br>
5. <b style="text-decoration:underline">50% (Percentile):</b>  Median value, which is the middle value when the data is sorted in ascending order (second quartile or 50th percentile).<br>
6. <b style="text-decoration:underline">75% (Percentile):</b>  Value below which 75% of the data falls (third quartile or 75th percentile).<br>
7. <b style="text-decoration:underline">Max:</b>  Maximum value in each column.<br><br>
 
![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)
<p style="font-size:17px;">When you are dealing with csv files or any case <span style="color:rgb(207, 159, 255)">read_csv()</span> is very important. you know there are total about 50 parameters of it.<br>But we are going to study around 15 or 16 important parameters of it.</p>

## (ii) Opening a csv file from an URL or server:

In [45]:
# The requests library is used for making HTTP requests
import requests
# 'StringIO' from 'io' is used to read and write text data in memory.
from io import StringIO

# URL from where we are requesting a csv file
url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"

# the headers (which include user-agent information) are defined.
# User-Agent: basically it's your browser, so To find this string: type 'about:version' in your browser. you'll find the same.
headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36"}

# An HTTP GET request is made to the URL with the defined headers.
req = requests.get(url, headers=headers) # If I directly prints it, It shows '<Response [200]>' as output.

# The text data from the response is converted into an 'in-memory text stream' using StringIO
data = StringIO(req.text)

# the OUTPUT tells that,this variable is an object of the StringIO class. and stored at given memory address
print(data)

<_io.StringIO object at 0x000001761325BBE0>

In [37]:
pd.read_csv(data)

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]


<h3 style="color:rgb(100, 149, 237)">We could do the same with just, but may be It won't work in case http request-response server. I am not sure at this point.</h3>

In [1]:
import pandas as pd

# URL of the CSV file
url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"

# Read the CSV file from the URL
df = pd.read_csv(url)
df

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

<hr style="margin-bottom: 50px;"> 
<span style="color:rgb(100, 149, 237);font-weight:bold; font-size:20px"># Additional Notes: Let's go over these 2 lines again:</span>

`req = requests.get(url, headers=headers)`
<br>
`data = StringIO(req.text)`


<span style="color:rgb(0, 255, 255);font-weight:bold; font-size:18px">requests.get(url) :</span><br>
* This function sends an HTTP GET request to the specified URL and <i>returns a Response object </i>. 
* This <i>Response object</i> contains the server’s response to your request.

Here are some of the attributes of the <i>Response object</i> that you can access:

* <span style="color:rgb(207, 159, 255)">status_code: </span> This attribute contains the HTTP status code that the server returned. For example, 200 means the request was successful, while 404 means the requested URL was not found on the server.

* <span style="color:rgb(207, 159, 255)">text: </span> This attribute contains the text of the response’s content. You can use this to read the content of the file at the URL (like the CSV file in your code).
* <span style="color:rgb(207, 159, 255)">headers: </span> This attribute is a dictionary containing the response headers. These headers can give you information about the server and the file you requested.
* <span style="color:rgb(207, 159, 255)">url: </span> This attribute contains the URL of the response.
* <span style="color:rgb(207, 159, 255)">content: </span> This attribute contains the content of the response in bytes. This is useful if you’re downloading a non-text file like an image or a PDF.
* <span style="color:rgb(207, 159, 255)">json(): </span> This method returns the JSON response body, if any, as a Python dictionary.
<br><br>
<span style="color:rgb(100, 149, 237);font-weight:bold; font-size:19px"># Lets check all these Attributes one by one: </span>

In [13]:
import pandas as pd
import requests
from io import StringIO

url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36"}
req = requests.get(url, headers=headers) # req = Response Object, let's verify above attributes then

In [10]:
# 1.  status_code
print(req.status_code)

200

In [24]:
# 2. text
print(req.text) # well it outputs same as above, although it's not much visible, but on github it was totally visible

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## (iii) Parameters of read_csv(): 

You can check out all the attributes of 'read_csv()' here: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

<span style="color:rgb(0, 255, 255);font-weight:bold; font-size:18px">1. 'sep' parameter:</span><br>
* It's default value = comma(,).

<i style="font-size:17px">What if we read a file whose seprator is not comma ?</i><br>
In that case we have to override 'sep value' in order to get things right. see example below:

In [20]:
import pandas as pd
df = pd.read_csv("datasets/movie_titles_metadata.tsv")
df

    m0\t10 things i hate about you\t1999\t6.90\t62847\t['comedy' 'romance']
0    m1\t1492: conquest of paradise\t1992\t6.20\t10...
1    m2\t15 minutes\t2001\t6.10\t25854\t['action' '...
2    m3\t2001: a space odyssey\t1968\t8.40\t163227\...
3    m4\t48 hrs.\t1982\t6.90\t22289\t['action' 'com...
4    m5\tthe fifth element\t1997\t7.50\t133756\t['a...
..                                                 ...
611  m612\twatchmen\t2009\t7.80\t135229\t['action' ...
612  m613\txxx\t2002\t5.60\t53505\t['action' 'adven...
613  m614\tx-men\t2000\t7.40\t122149\t['action' 'sc...
614  m615\tyoung frankenstein\t1974\t8.00\t57618\t[...
615  m616\tzulu dawn\t1979\t6.40\t1911\t['action' '...

[616 rows x 1 columns]

### From this data, we can find out some things like:
`1. sep = \t`
<br>
`2. column names are not defined, Hence it is treating first row as column names`

Now because default sep = comma, but in this dataset `sep = \t`, so that's why read_csv is giving us that absurd output.

In [50]:
df = pd.read_csv("datasets/movie_titles_metadata.tsv",sep='\t')
df

,m0,10 things i hate about you,1999,6.90,62847,['comedy' 'romance']
0,m1,1492: conquest of paradise,1992,6.2,10421.0,['adventure' 'biography' 'drama' 'history']
1,m2,15 minutes,2001,6.1,25854.0,['action' 'crime' 'drama' 'thriller']
2,m3,2001: a space odyssey,1968,8.4,163227.0,['adventure' 'mystery' 'sci-fi']
3,m4,48 hrs.,1982,6.9,22289.0,['action' 'comedy' 'crime' 'drama' 'thriller']
4,m5,the fifth element,1997,7.5,133756.0,['action' 'adventure' 'romance' 'sci-fi' 'thri...
...,...,...,...,...,...,...
611,m612,watchmen,2009,7.8,135229.0,['action' 'crime' 'fantasy' 'mystery' 'sci-fi'...
612,m613,xxx,2002,5.6,53505.0,['action' 'adventure' 'crime']
613,m614,x-men,2000,7.4,122149.0,['action' 'sci-fi']
614,m615,young frankenstein,1974,8.0,57618.0,['comedy' 'sci-fi']
615,m616,zulu dawn,1979,6.4,1911.0,['action' 'adventure' 'drama' 'history' 'war']

<span style="color:rgb(0, 255, 255);font-weight:bold; font-size:18px">2. 'names' parameter:</span><br>
* It's basically a `List` of column labels.
<br><br>
<span style="color:rgb(100, 149, 237); font-size:16px">Here in above dataset column names are not given so it is treating first row as column names. Hence to apply column names explicitly. we use 'names' parameter</span>

In [54]:
# So To assign names, a list is passed
df = pd.read_csv("datasets/movie_titles_metadata.tsv", sep = '\t', names = ['Id', 'Movie_Name', 'Released_year', 'Rating', 'Votes', 'genres'])
df

,Id,Movie_Name,Released_year,Rating,Votes,genres
0,m0,10 things i hate about you,1999,6.9,62847.0,['comedy' 'romance']
1,m1,1492: conquest of paradise,1992,6.2,10421.0,['adventure' 'biography' 'drama' 'history']
2,m2,15 minutes,2001,6.1,25854.0,['action' 'crime' 'drama' 'thriller']
3,m3,2001: a space odyssey,1968,8.4,163227.0,['adventure' 'mystery' 'sci-fi']
4,m4,48 hrs.,1982,6.9,22289.0,['action' 'comedy' 'crime' 'drama' 'thriller']
...,...,...,...,...,...,...
612,m612,watchmen,2009,7.8,135229.0,['action' 'crime' 'fantasy' 'mystery' 'sci-fi'...
613,m613,xxx,2002,5.6,53505.0,['action' 'adventure' 'crime']
614,m614,x-men,2000,7.4,122149.0,['action' 'sci-fi']
615,m615,young frankenstein,1974,8.0,57618.0,['comedy' 'sci-fi']
616,m616,zulu dawn,1979,6.4,1911.0,['action' 'adventure' 'drama' 'history' 'war']

<span style="color:rgb(0, 255, 255);font-weight:bold; font-size:18px">3. 'header' parameter:</span><br>

<h2 style="color:rgb(50, 205, 50)"> 2. From Json or SQL format :</h2>

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

<h2 style="color:rgb(50, 205, 50)">3. Fetch data from API: </h2>

<h2 style="color:rgb(50, 205, 50)">4. From Web-Scrapping: </h2>